cmsis-svd/cmsis-svd/data/Atmel/ATSAM3X8E.svd
        <register>
          <name>MAM7</name>
          <description>Mailbox Acceptance Mask Register (MB = 7)</description>
          <addressOffset>0x000002E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MIDvB</name>
              <description>Complementary bits for identifier in extended frame mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDvA</name>
              <description>Identifier for standard frame mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDE</name>
              <description>Identifier Version</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MID7</name>
          <description>Mailbox ID Register (MB = 7)</description>
          <addressOffset>0x000002E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MIDvB</name>
              <description>Complementary bits for identifier in extended frame mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDvA</name>
              <description>Identifier for standard frame mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDE</name>
              <description>Identifier Version</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MFID7</name>
          <description>Mailbox Family ID Register (MB = 7)</description>
          <addressOffset>0x000002EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MFID</name>
              <description>Family ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSR7</name>
          <description>Mailbox Status Register (MB = 7)</description>
          <addressOffset>0x000002F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIMESTAMP</name>
              <description>Timer value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDLC</name>
              <description>Mailbox Data Length Code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRTR</name>
              <description>Mailbox Remote Transmission Request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MABT</name>
              <description>Mailbox Message Abort</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRDY</name>
              <description>Mailbox Ready</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMI</name>
              <description>Mailbox Message Ignored</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDL7</name>
          <description>Mailbox Data Low Register (MB = 7)</description>
          <addressOffset>0x000002F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDL</name>
              <description>Message Data Low Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDH7</name>
          <description>Mailbox Data High Register (MB = 7)</description>
          <addressOffset>0x000002F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDH</name>
              <description>Message Data High Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR7</name>
          <description>Mailbox Control Register (MB = 7)</description>
          <addressOffset>0x000002FC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>MDLC</name>
              <description>Mailbox Data Length Code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MRTR</name>
              <description>Mailbox Remote Transmission Request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MACR</name>
              <description>Abort Request for Mailbox x</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MTCR</name>
              <description>Mailbox Transfer Command</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
