cmsis-svd/cmsis-svd/data/Atmel/ATSAM3X8E.svd
        <register>
          <name>ECC_SR2</name>
          <description>SMC ECC status 2 Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RECERR8</name>
              <description>Recoverable Error in the page between the 2048th and the 2303rd bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR8</name>
              <description>ECC Error in the page between the 2048th and the 2303rd bytes</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR8</name>
              <description>Multiple Error in the page between the 2048th and the 2303rd bytes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR9</name>
              <description>Recoverable Error in the page between the 2304th and the 2559th bytes</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR9</name>
              <description>ECC Error in the page between the 2304th and the 2559th bytes</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR9</name>
              <description>Multiple Error in the page between the 2304th and the 2559th bytes</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR10</name>
              <description>Recoverable Error in the page between the 2560th and the 2815th bytes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR10</name>
              <description>ECC Error in the page between the 2560th and the 2815th bytes</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR10</name>
              <description>Multiple Error in the page between the 2560th and the 2815th bytes</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR11</name>
              <description>Recoverable Error in the page between the 2816th and the 3071st bytes</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR11</name>
              <description>ECC Error in the page between the 2816th and the 3071st bytes</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR11</name>
              <description>Multiple Error in the page between the 2816th and the 3071st bytes</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR12</name>
              <description>Recoverable Error in the page between the 3072nd and the 3327th bytes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR12</name>
              <description>ECC Error in the page between the 3072nd and the 3327th bytes</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR12</name>
              <description>Multiple Error in the page between the 3072nd and the 3327th bytes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR13</name>
              <description>Recoverable Error in the page between the 3328th and the 3583rd bytes</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR13</name>
              <description>ECC Error in the page between the 3328th and the 3583rd bytes</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR13</name>
              <description>Multiple Error in the page between the 3328th and the 3583rd bytes</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR14</name>
              <description>Recoverable Error in the page between the 3584th and the 3839th bytes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR14</name>
              <description>ECC Error in the page between the 3584th and the 3839th bytes</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR14</name>
              <description>Multiple Error in the page between the 3584th and the 3839th bytes</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR15</name>
              <description>Recoverable Error in the page between the 3840th and the 4095th bytes</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR15</name>
              <description>ECC Error in the page between the 3840th and the 4095th bytes</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR15</name>
              <description>Multiple Error in the page between the 3840th and the 4095th bytes</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR2</name>
          <description>SMC ECC parity 2 Register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR2_W8BIT</name>
          <description>SMC ECC parity 2 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR3</name>
          <description>SMC ECC parity 3 Register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR3_W8BIT</name>
          <description>SMC ECC parity 3 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR4</name>
          <description>SMC ECC parity 4 Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR4_W8BIT</name>
          <description>SMC ECC parity 4 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR5</name>
          <description>SMC ECC parity 5 Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR5_W8BIT</name>
          <description>SMC ECC parity 5 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR6</name>
          <description>SMC ECC parity 6 Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR6_W8BIT</name>
          <description>SMC ECC parity 6 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR7</name>
          <description>SMC ECC parity 7 Register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR7_W8BIT</name>
          <description>SMC ECC parity 7 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR8</name>
          <description>SMC ECC parity 8 Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
